app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" WHERE (name ilike '%lksjdflksjflksdjfsdf%')
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", "2283652"]]
---
  def index
    @artists = if params[:song_id]
      Song.find(params[:song_id]).artist