app/controllers/favorite_artists_controller.rb

  def index
    if params[:artist_id]
      @favorite_artists = filters Artist.find(params[:artist_id]).favorite_artists
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "619808"]]