app/controllers/searches_controller.rb

  def index
    @searches = Search.all
---
SELECT "searches".* FROM "searches"