app/controllers/songs_controller.rb

  def index
    songs = Song
    if params[:artist_id]
      @artist = Artist.find params[:artist_id]
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "494710"]]