app/controllers/track_plays_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", "1955619"]]
---
  def index
    if params[:song_id]
      @track_plays = filters Song.find(params[:song_id]).track_plays