app/controllers/users_controller.rb

  def index
    if params[:artist_id]
      @users = filters Artist.find(params[:artist_id]).users
    elsif params[:song_id]
      @users = filters Song.find(params[:song_id]).users
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", "505011"]]
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", "1955619"]]